app/views/users/show.html.erb

		  <tbody>
		    <% @user.identities.each do |identity| %>
---
SELECT "identities".* FROM "identities" WHERE "identities"."user_id" = $1  [["user_id", 1]]