app/views/home/index.html.erb

SELECT  "identities".* FROM "identities" WHERE "identities"."user_id" = $1 AND "identities"."provider" = $2  ORDER BY "identities"."id" ASC LIMIT 1  [["user_id", 1], ["provider", "spotify"]]
---

<% spotify = current_user.identities.where(provider: 'spotify').first%>