app/controllers/home_controller.rb

SELECT  "identities".* FROM "identities" WHERE "identities"."provider" = $1  ORDER BY "identities"."id" ASC LIMIT 1  [["provider", "soundcloud"]]
UPDATE "identities" SET "access_token" = $1, "refresh_token" = $2, "updated_at" = $3 WHERE "identities"."id" = $4
---
  def index
  	if(params.has_key?(:access_token))
  		@access_token = params[:access_token]
  		soundcloud = Identity.where(provider: 'soundcloud').first
  		soundcloud.save_soundcloud_token(@access_token)