app/controllers/home_controller.rb

  def set_spotify
  	@spotify = current_user.identities.where(provider:'spotify').first
---
SELECT  "identities".* FROM "identities" WHERE "identities"."user_id" = $1 AND "identities"."provider" = $2  ORDER BY "identities"."id" ASC LIMIT 1  [["user_id", 1], ["provider", "spotify"]]