app/controllers/soundcloud_controller.rb

SELECT "identities".* FROM "identities" WHERE "identities"."uid" = $1  [["uid", "162930727"]]
INSERT INTO "identities" ("user_id", "uid", "provider", "access_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def connected
		# create client object with app credentials
		client = Soundcloud.new(:client_id => current_user.client_id,
		                    :client_secret => current_user.client_secret,
		                    :redirect_uri => "http://localhost:3000/soundcloud/oauth-callback")
		# exchange authorization code for access token
		access_token = client.exchange_token(:code => params[:code])
		client = Soundcloud.new(:access_token => access_token["access_token"])
		# make an authenticated call
		soundcloud_user = client.get('/me')
		unless Identity.where(:uid => soundcloud_user["id"]).present?
		  Identity.create_from_soundcloud(current_user, soundcloud_user["id"], access_token)

SELECT  "identities".* FROM "identities" WHERE "identities"."user_id" = $1 AND "identities"."provider" = $2  ORDER BY "identities"."id" ASC LIMIT 1  [["user_id", 1], ["provider", "soundcloud"]]
---
	def set_soundcloud
		soundcloud = current_user.identities.where(provider:'soundcloud').first