app/controllers/users_controller.rb

  def finish_signup
    # authorize! :update, @user
    if request.patch? && params[:user] #&& params[:user][:email]
      if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "confirmation_token" = $2, "confirmation_sent_at" = $3 WHERE "users"."id" = $4  [["updated_at", "2016-07-18 12:36:04.409060"], ["confirmation_token", "waa5qXx9dyPr-HD54xXW"], ["confirmation_sent_at", "2016-07-18 12:36:04.410118"], ["id", 1]]